app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save